tongkong1/2023Ti/MK66F18_Ref9.c
void MotorCtrlOL(uint8_t SpeedCmd)
{
	if(SpeedCmd>100)
		return;

	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, SpeedCmd);
	FTM_SetSoftwareTrigger(FTM0_PERIPHERAL, true);
}

// Closed-loop speed control
// feedback available on MotorSpeedFdbk1
void MotorCtrlCL(void)
{
	uint16_t CtrlValue=0;

	CtrlValue = MotorSpeedCal;		// MotorSpeedCal updated in PIT IRQ at an interval of 5ms
	if (CtrlValue > 40) CtrlValue = 40;

	//FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, SpeedCmd);
	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, CtrlValue);
	FTM_SetSoftwareTrigger(FTM0_PERIPHERAL, true);

}

// Your code here to find the target tracking point
// Result: update TrackIndex value
// uint8_t TrackFlag=0;	// 0: Invalid track detection
//						// 1: Valid/Normal track found
//						// 2: Start/End Mark detected
//						// 3: Cross-road detected
//						// 4: Undefined

int stage = 0;
int last_stage = 0;
int n = 0;
int average;
int num = 0;

void FindTrackPoint(void)
{
	int16_t DMax, DMin, DV;
	uint8_t MaxIndex, MinIndex;
	uint16_t i;
	uint16_t max;
	uint16_t i_max;
	num = 0;

	DMax = 0;
	DMin = 0;
	max = 0;
	average = 0;

	for (i=0; i<126; i++)
	{
		average = average + CCDData[i];
		if(abs(CCDData[i+2] - CCDData[i]) > 150)
		{
			num++;
		}
		if(CCDData[i]>max)
		{
			max = CCDData[i];
			i_max = i;
		}

		DV = CCDData[i+2] - CCDData[i];
		if (DV > DMax)		// Raising edge
		{
			DMax = DV;
			MaxIndex = i+1;
		}
		if (DV < DMin)		// Falling edge
		{
			DMin = DV;
			MinIndex = i+1;
		}
	}
	average = average / 126;
	if(num == 0)
	{
		if(average < 330)
			{
				stage = 2;
			}
		//stage = 2;
	}
	else if(num >= 2 && num < 6)
	{
		 stage = 0;
	}
	else if(num >= 8)
	{
		 stage = 1;
	}

	if(average < 330)
	{
		stage = 2;
	}
	// Cross-road?
	// Start/End mark?
	if ((MaxIndex<MinIndex) || (DMax<120) || (DMin>(-120)))	// Invalid cases
	{
		TrackFlag = 0;
		//TrackErrorCounter++;
	}
	else
	{
		if ((MaxIndex-MinIndex) > 30)	// One of invalid cases
		{
			TrackFlag = 0;
			//TrackErrorCounter++;
		}
		else
		{
			TrackFlag = 1;		// Normal track found
			TrackIndex = (MaxIndex+MinIndex)/2;
			//TrackErrorCounter = 0;
		}
	}
}

// indicate TrackIndex on OLED
void Draw_Mark(TrackIndex)
{
	uint8_t i=0;
	for (i=4; i<8; i++)
	{
		OLED_Set_Pos(TrackIndex, i);
		OLED_WrDat(0xFF);
	}
}

int SpeedZhi = 0;
int SpeedWan = 0;

void BEEP()
{
	BEEP_ON();
	delay();
	BEEP_OFF();
	delay();
	BEEP_ON();
	delay();
	BEEP_OFF();
}
/*
 * @brief   Application entry point.
 */
int tmx = 0, tmy = 0, tmi;

/*
void Follow_A4(){

 		//x0-r0
 		//算边(实际最后是三条边)

 		xeg1 = sqrt(1+(x0 - x0)*(x0 - x0)*0.00467*0.00467 + (y0 - y0)*(y0 - y0)*0.00467*0.00467);//a1
		xeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (y0 - y0)*(y0 - y0)*0.00467*0.00467);//c
		yeg1 = xeg2;
		yeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//a2
 		//算角
 		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2 - (x0 - r0x)*(x0 - r0x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
		delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2 - (y0 - r0y)*(y0 - r0y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
		deltx = (int)(abs(deltx));
		delty = (int)(abs(delty));
		if(deltx<400 && delty <400){
			tmx = deltx/20;
			txy = delty/20;
			for(tmi = 0; tmi<20;tmi++){
				if(r0x<b_rx){
	     			LoopCounter2+=tmx;
	     		}
	     		else{
	     			LoopCounter2-=tmx;
	     		}
	     		if(r0y>b_ry){
	     			LoopCounter+=tmy;
	     		}
	     		else{
	     			LoopCounter-=tmy;
	     		}

	         	Update_ServoUS(kFTM_Chnl_0, LoopCounter);
	      	    Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

	         	delay_short();
			}

		}
		Round++;
		delay_short();
 		//r0-r1

 		//算边(实际最后是三条边)

 		xeg1 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//a1
		xeg2 = sqrt(1*1+(r1x - x0)*(r1x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//c
		yeg1 = xeg2;
		yeg2 = sqrt(1*1+(r1x - x0)*(r1x - x0)*0.00467*0.00467 + (r1y - y0)*(r1y - y0)*0.00467*0.00467);//a2
 		//算角
 		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (r0x - r1x)*(r0x - r1x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
		delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (r0y - r1y)*(r0y - r1y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
		deltx = (int)(abs(deltx));
		delty = (int)(abs(delty));
		if(deltx<400 && delty <400){
			tmx = deltx/20;
			txy = delty/20;
			for(tmi = 0; tmi<20;tmi++){
				if(r1x<r0x){
	     			LoopCounter2+=tmx;
	     		}
	     		else{
	     			LoopCounter2-=tmx;
	     		}
	     		if(r1y>r0y){
	     			LoopCounter+=tmy;
	     		}
	     		else{
	     			LoopCounter-=tmy;
	     		}

	         	Update_ServoUS(kFTM_Chnl_0, LoopCounter);
	      	    Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

	         	delay_short();
			}

		}
		delay_short();
		Round++;
 		//r1-r2


 		//算边(实际最后是三条边)

 		xeg1 = sqrt(1*1+(r1x - x0)*(r1x - x0)*0.00467*0.00467 + (r1y - y0)*(r1y - y0)*0.00467*0.00467);//a1
		xeg2 = sqrt(1*1+(r2x - x0)*(r2x - x0)*0.00467*0.00467 + (r1y - y0)*(r1y - y0)*0.00467*0.00467);//c
		yeg1 = xeg2;
		yeg2 = sqrt(1*1+(r2x - x0)*(r2x - x0)*0.00467*0.00467 + (r2y - y0)*(r2y - y0)*0.00467*0.00467);//a2
 		//算角
 		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (r1x - r2x)*(r1x - r2x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
		delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (r1y - r2y)*(r1y - r2y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
		deltx = (int)(abs(deltx));
		delty = (int)(abs(delty));
		if(deltx<400 && delty <400){
			tmx = deltx/20;
			txy = delty/20;
			for(tmi = 0; tmi<20;tmi++){
				if(r2x<r1x){
	     			LoopCounter2+=tmx;
	     		}
	     		else{
	     			LoopCounter2-=tmx;
	     		}
	     		if(r2y>r1y){
	     			LoopCounter+=tmy;
	     		}
	     		else{
	     			LoopCounter-=tmy;
	     		}

	         	Update_ServoUS(kFTM_Chnl_0, LoopCounter);
	      	    Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

	         	delay_short();
			}

