tongkong1/2023Ti/MK66F18_Ref9.c
		}
		delay_short();
		Round++;
 		//red-r3


 		//算边(实际最后是三条边)

 		xeg1 = sqrt(1*1+(r2x - x0)*(r2x - x0)*0.00467*0.00467 + (r2y - y0)*(r2y - y0)*0.00467*0.00467);//a1
		xeg2 = sqrt(1*1+(r3x - x0)*(r3x - x0)*0.00467*0.00467 + (r2y - y0)*(r2y - y0)*0.00467*0.00467);//c
		yeg1 = xeg2;
		yeg2 = sqrt(1*1+(r3x - x0)*(r3x - x0)*0.00467*0.00467 + (r3y - y0)*(r3y - y0)*0.00467*0.00467);//a2
 		//算角
 		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (r2x - r3x)*(r2x - r3x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
		delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (r2y - r3y)*(r2y - r3y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
		deltx = (int)(abs(deltx));
		delty = (int)(abs(delty));
		if(deltx<400 && delty <400){
			tmx = deltx/20;
			txy = delty/20;
			for(tmi = 0; tmi<20;tmi++){
				if(r3x<r2x){
	     			LoopCounter2+=tmx;
	     		}
	     		else{
	     			LoopCounter2-=tmx;
	     		}
	     		if(r3y>r2y){
	     			LoopCounter+=tmy;
	     		}
	     		else{
	     			LoopCounter-=tmy;
	     		}

	         	Update_ServoUS(kFTM_Chnl_0, LoopCounter);
	      	    Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

	         	delay_short();
			}

		}
		delay_short();
 		//red-r0


 		//算边(实际最后是三条边)

 		xeg1 = sqrt(1*1+(r3x - x0)*(r3x - x0)*0.00467*0.00467 + (r3y - y0)*(r3y - y0)*0.00467*0.00467);//a1
		xeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r3y - y0)*(r3y - y0)*0.00467*0.00467);//c
		yeg1 = xeg2;
		yeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//a2
 		//算角
 		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (r3x - r0x)*(r3x - r0x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
		delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (r3y - r0y)*(r3y - r0y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
		deltx = (int)(abs(deltx));
		delty = (int)(abs(delty));
		if(deltx<400 && delty <400){
			tmx = deltx/20;
			txy = delty/20;
			for(tmi = 0; tmi<20;tmi++){
				if(r0x<r3x){
	     			LoopCounter2+=tmx;
	     		}
	     		else{
	     			LoopCounter2-=tmx;
	     		}
	     		if(r0y>r3y){
	     			LoopCounter+=tmy;
	     		}
	     		else{
	     			LoopCounter-=tmy;
	     		}

	         	Update_ServoUS(kFTM_Chnl_0, LoopCounter);
	      	    Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

	         	delay_short();
			}

		}
		delay_short();



	}

}*/


// Variables for PID controller
    			float error = 0;
    			float integral = 0;
    			float derivative = 0;
    			float last_error = 0;

    			// Set the initial reference and state values
    			const int TrackIndex_base = 64;
    			const int tempInt_base = 1470;
    			const int tempInt_min = 1150;
    			const int tempInt_max = 1960;

uint8_t Round = 0;
uint8_t round = 0;
uint8_t sscan = 0;
double x0 = 0, y0 = 0;//base point
float Dx = 0, Dy = 0;
double xeg1 = 0,xeg2 = 0;//横移三角的余弦公式的两边长
float yeg1 = 0,yeg2 = 0;//纵移三角的余弦公式的两边长
float deltx = 0, delty = 0;




int main(void) {
	x0 = 94;
	y0 = 71;
    uint8_t TaskID = 0;		// loop switch
    uint32_t LastSecond=0;
    //uint16_t ServoDutyCounter=0;
    //bool ServoDutyCountDir=1;		// 0: count down; 1: count up
	uint32_t tempInt = 0;
	uint16_t CCDMin = 0;
	uint8_t index = 0;
	uint8_t CCD2PC[260];	// data to be sent to PC
	//uint32_t LastSecond=0;
    uint16_t Counter=0;//通道0减速倍速位
    uint16_t Counter2=0;//通道1减速倍速位
    uint16_t LoopCounter=1440;//通道0绕Y轴转计数计数
    uint16_t LoopCounter2=1400;//通道1绕X轴转计数
	char OLEDLine1[] = "0123456789abcdef";
	char OLEDLine2[] = "0123456789abcdef";
	char OLEDLine3[] = "0123456789abcdef";
	char OLEDLine4[] = "0123456789abcdef";

    /* Init board hardware. */
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();

    BOARD_InitI2C();
    OLED_Init();

    KC4D();		// Welcome message
    // Header of CCD data frame, seekfree protocol
    CCD2PC[0] = 0x00;
	CCD2PC[1] = 0xFF;
	CCD2PC[2] = 0x01;
	CCD2PC[3] = 0x00;

#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    /* Init FSL debug console. */
    BOARD_InitDebugConsole();
#endif

//	TaskID = (~((SW1()<<3) + (SW2()<<2) + (SW3()<<1) + SW4())) & 0x0F;
//    PRINTF("Task ID: %d\r\n", TaskID);

    LastSecond = ElapsedSeconds;
    LED1_ON();    LED2_OFF();

    volatile static int i = 0 ;
    //ServoDutyCountDir = 1;	// count up
    //ServoDutyCounter = 500;	// Lower Limit
/*
	if (TaskID == 1U)		// Test RC/Servo
	{
		QESVar = ServoDC1ref;
		ServoDC1 = ServoDC1ref;
		ServoDC2 = ServoDC2ref;
	}
    if (TaskID == 7U)		// using MT9V034?
		MT9V034_Init(50);
	if ((TaskID == 4U) || (TaskID == 9U))		// Test Motor driver?
	{
		M1_DISABLE();
		M2_DISABLE();
		FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_2, kFTM_EdgeAlignedPwm, 0);
		FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, 0);
    	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_4, kFTM_EdgeAlignedPwm, 0);
    	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_7, kFTM_EdgeAlignedPwm, 0);
		M1_ENABLE();
	}*/

    OLED_Init();

    static int r1x, r1y, r2x, r2y, r3x, r3y, r0x, r0y, b_rx, b_ry;
    static int nr1x, nr1y, nr2x, nr2y, nr3x, nr3y, nr0x, nr0y, nb_rx, nb_ry;
    static int lastb_rx = 0, lastb_ry = 0;
    static int lastr1x=0, lastr1y=0, lastr2x=0, lastr2y=0, lastr3x=0, lastr3y=0, lastr0x=0, lastr0y=0;

    while(1) {

    	 delay();
   // 	 sscan++;
    //	 if(sscan < 10){
    	    	//sscanf(CmdDataBuffer1, "#rx:%d y:%d rx:%d y:%d rx:%d y:%d rx:%d y:%d brx:%d y:%dEND",
    	    	        	      //     &r1x, &r1y, &r2x, &r2y, &r3x, &r3y, &r0x, &r0y, &rx, &ry);
    	    	sscanf(CmdDataBuffer1, "#r1x:%d y:%d r2x:%d y:%d r3x:%d y:%d r0x:%d y:%d r1x:%d y:%d r2x:%d y:%d r3x:%d y:%d r0x:%d y:%d b_rx:%d y:%dEND",
    	    	           &r1x, &r1y, &r2x, &r2y, &r3x, &r3y, &r0x, &r0y, &r1x, &r1y, &r2x, &r2y, &r3x, &r3y, &r0x, &r0y, &b_rx, &b_ry);

    	// }

    	PRINTF("r1x = %d\r\n", r1x);
    	PRINTF("r1y = %d\r\n", r1y);
        PRINTF("r2x = %d\r\n", r2x);
    	PRINTF("r2y = %d\r\n", r2y);
    	PRINTF("r3x = %d\r\n", r3x);
    	PRINTF("r3y = %d\r\n", r3y);
    	PRINTF("r0x = %d\r\n", r0x);
    	PRINTF("r0y = %d\r\n", r0y);
    	PRINTF("b_rx = %d\r\n", b_rx);
    	PRINTF("b_ry = %d\r\n", b_ry);
    	PRINTF("xeg1 = %lf\r\n",xeg1);
    	PRINTF("xeg2 = %lf\r\n",xeg2);
    	PRINTF("round = %d\r\n",round);
    	PRINTF("Round = %d\r\n",Round);
    	PRINTF("x0 = %lf\r\n",x0);
    	PRINTF("y0 = %lf\r\n",y0);
    	PRINTF("deltx = %f\r\n",deltx);
    	PRINTF("delty = %f\r\n",delty);
    	PRINTF("LoopCounter = %hu\r\n", LoopCounter);
    	PRINTF("LoopCounter2 = %hu\r\n", LoopCounter2);
    	PRINTF("\r\n");

