tongkong1/2023Ti/MK66F18_Ref9.c
     	if (KEY1()) {
     		LoopCounter=1370;
     		LoopCounter2=1400;
     		TaskID = 0;//reset
     		sscan = 0;
     	}
     	if (KEY2()) {
     		LoopCounter=1206;
     		LoopCounter2=1240;
     		round = 0;
     		TaskID = 1;//0.5*0.5
     	}
     	if (BTN()) {
     		LoopCounter=1360;
     		LoopCounter2=1400;
     		round = 0;
     		Round = 0;
     		TaskID = 2;//a4
     	}
     	if (KEY2() && KEY1()) {
     		LoopCounter=1285;
     		LoopCounter2=1309;
     		round = 0;
     		TaskID = 3;//a4 off
     	}


     	switch(TaskID){//model0-2
     	case 0://reset

     		//蜂鸣器
     		/*
     		BEEP_ON();
     		LED1_ON();
     		LED2_ON();
     		delay_short();
     		BEEP_OFF();
     		LED1_OFF();
     		LED2_OFF();
     		delay_short();

     		BEEP_ON();
     		LED1_ON();
     		LED2_ON();
     		delay_short();
     		BEEP_OFF();
     		LED1_OFF();
     		LED2_OFF();
     		delay_short();

     		BEEP_ON();
     		LED1_ON();
     		LED2_ON();
     		delay_short();
     		BEEP_OFF();
     		LED1_OFF();
     		LED2_OFF();
     		delay_short();

     		*/


     		break;


     	case 1://0.5*0.5
     		switch(round){
     		case 0:
     			//if(Counter<5)Counter++;
     			//if(Counter>=5 )Counter = 0;
     			if(Counter == 0){
     				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter++;
     			}
     			if(LoopCounter>=1515){round++;delay_short();break;}
 				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter++;
 				if(LoopCounter>=1515){round++;delay_short();break;}
 				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter++;
 				if(LoopCounter>=1515){round++;delay_short();break;}
 				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter++;
 				if(LoopCounter>=1515){round++;delay_short();break;}
 				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter++;
 				if(LoopCounter>=1515){round++;delay_short();break;}
 				break;
     		case 1:
     			//if(Counter2<5)Counter2++;
     			//if(Counter2>=5 )Counter2 = 0;
     			if(Counter2 == 0){
     				if(LoopCounter2>=1240 && LoopCounter2<=1560)LoopCounter2++;
     			}
     			if(LoopCounter2>=1560){round++;delay_short();break;}
     			if(LoopCounter2>=1240 && LoopCounter2<=1565)LoopCounter2++;
     			if(LoopCounter2>=1560){round++;delay_short();break;}
     			if(LoopCounter2>=1240 && LoopCounter2<=1565)LoopCounter2++;
     			if(LoopCounter2>=1560){round++;delay_short();break;}
       			if(LoopCounter2>=1240 && LoopCounter2<=1565)LoopCounter2++;
         		if(LoopCounter2>=1560){round++;delay_short();break;}
           		if(LoopCounter2>=1240 && LoopCounter2<=1565)LoopCounter2++;
            	if(LoopCounter2>=1560){round++;delay_short();break;}
     			break;
     		case 2:
     			//if(Counter<5)Counter++;
     			//if(Counter>=5 )Counter = 0;
     			if(Counter == 0){
     				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter--;
     			}
     			if(LoopCounter<=1206){round++;delay_short();break;}
 				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter--;
     			if(LoopCounter<=1206){round++;delay_short();break;}
 				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter--;
     			if(LoopCounter<=1206){round++;delay_short();break;}
     			if(LoopCounter<=1206){round++;delay_short();break;}
 				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter--;
     			if(LoopCounter<=1206){round++;delay_short();break;}
 				if(LoopCounter>=1206 && LoopCounter<=1515)LoopCounter--;
     			break;
     		case 3:
     			//if(Counter2<5)Counter2++;
     			//if(Counter2>=5 )Counter2 = 0;
     			if(Counter2 == 0){
     				if(LoopCounter2>=1240 && LoopCounter2<=1560)LoopCounter2--;
     			}
     			if(LoopCounter2<=1240){round = 0;delay_short();break;}
     			if(LoopCounter2>=1240 && LoopCounter2<=1565)LoopCounter2--;
     			if(LoopCounter2<=1240){round = 0;delay_short();break;}
     			if(LoopCounter2>=1240 && LoopCounter2<=1565)LoopCounter2--;
     			if(LoopCounter2<=1240){round = 0;delay_short();break;}
     			if(LoopCounter2>=1240 && LoopCounter2<=1565)LoopCounter2--;
     			if(LoopCounter2<=1240){round = 0;delay_short();break;}
     			if(LoopCounter2>=1240 && LoopCounter2<=1565)LoopCounter2--;
     			if(LoopCounter2<=1240){round = 0;delay_short();break;}
     			break;
     		}
     		break;

     	case 2://a4

     		//xeg1 = sqrt(1*1+abs((r1x - x0))*abs((r1x - x0))*0.00467*0.00467 + abs((r1y - y0))*abs((r1y - y0))*0.00467*0.00467);

     		/*
     		//法2
     		//回到基准点x0y0
     		//识别黑框，比较数据如果上一次的黑框和这次的一样/非常接近，用这个数据
     		//分5步实现控制舵机，不要点的坐标

     		//回到基准点x0y0
     		LoopCounter=1360;
     		LoopCounter2=1500;
     		Update_ServoUS(kFTM_Chnl_0, LoopCounter);
     		Update_ServoUS(kFTM_Chnl_1, LoopCounter2);
     		delay();

     		//识别黑框，比较数据如果上一次的黑框和这次的一样/非常接近，用这个数据
     		if(){}
     		else{last}

     		//
     		if(lastb_rx ==  b_rx && lastb_ry == b_ry){
     			Round++;
     			if(Round == 10){
     				Round = 0;
     				x0 = b_rx;
     				y0 = b_ry;
     				Follow_A4();


     			}


     		}
			lastb_rx = b_rx;
			lastb_ry = b_ry;
     		break;
     		*/
     		Update_ServoUS(kFTM_Chnl_0, LoopCounter);
     		Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

     		sscan++;
     		if(sscan == 10){
    	    	sscanf(CmdDataBuffer1, "#r1x:%d y:%d r2x:%d y:%d r3x:%d y:%d r0x:%d y:%d r1x:%d y:%d r2x:%d y:%d r3x:%d y:%d r0x:%d y:%d b_rx:%d y:%dEND",
    	    	           &nr1x, &nr1y, &nr2x, &nr2y, &nr3x, &nr3y, &nr0x, &nr0y, &nr1x, &nr1y, &nr2x, &nr2y, &nr3x, &nr3y, &nr0x, &nr0y, &nb_rx, &nb_ry);

     		}



     		if(sscan==11){
     			r1x = nr1x;
     			r1y = nr1y;
     			r2x = nr2x;
     			r2y = nr2y;
     			r3x = nr3x;
     			r3y = nr3y;
     			r0x = nr0x;
     			b_rx = nb_rx;
     			b_ry = nb_ry;


     			//x0-r0
     			xeg1 = sqrt(1+(x0 - x0)*(x0 - x0)*0.00467*0.00467 + (y0 - y0)*(y0 - y0)*0.00467*0.00467);//a1
				xeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (y0 - y0)*(y0 - y0)*0.00467*0.00467);//c
				yeg1 = xeg2;
				yeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//a2
				//算角
				deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2 - (x0 - r0x)*(x0 - r0x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
				delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2 - (y0 - r0y)*(y0 - r0y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
				deltx = (int)(abs(deltx));
				delty = (int)(abs(delty));
				if(deltx<400 && delty <400){
					tmx = deltx/5;
					tmy = delty/5;
					for(tmi = 0; tmi<5;tmi++){
						if(r0x<b_rx){
							LoopCounter2+=tmx;
							LoopCounter2-=3;
						}
						else{
							LoopCounter2-=tmx;
							LoopCounter2-=3;
						}
						if(r0y>b_ry){
							LoopCounter+=tmy;
							LoopCounter+=7;
						}
						else{
							LoopCounter-=tmy;
							LoopCounter+=7;
						}

						Update_ServoUS(kFTM_Chnl_0, LoopCounter);
						Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

						delay();
						delay();
						delay();
					}

