tongkong1/2023Ti/MK66F18_Ref9.c
				}
				Round++;
				delay();
				delay();
				delay();
				//r0-r3


				//算边(实际最后是三条边)

				xeg1 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//a1
				xeg2 = sqrt(1*1+(r3x - x0)*(r3x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//c
				yeg1 = xeg2;
				yeg2 = sqrt(1*1+(r3x - x0)*(r3x - x0)*0.00467*0.00467 + (r3y - y0)*(r3y - y0)*0.00467*0.00467);//a2
				//算角
				deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (r3x - r0x)*(r3x - r0x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
				delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (r3y - r0y)*(r3y - r0y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
				deltx = (int)(abs(deltx));
				delty = (int)(abs(delty));
				if(deltx<400 && delty <400){
					tmx = deltx/5;
					tmy = delty/5;
					for(tmi = 0; tmi<5;tmi++){
						if(r3x<r0x){
							LoopCounter2+=tmx;
							LoopCounter2-=7;
						}
						else{
							LoopCounter2-=tmx;
							LoopCounter2-=7;
						}
						if(r3y>r0y){
							LoopCounter+=tmy;
						}
						else{
							LoopCounter-=tmy;
						}

						Update_ServoUS(kFTM_Chnl_0, LoopCounter);
						Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

						delay();
						delay();
						delay();
					}
					delay();
					delay();
					delay();
					Round++;
				}


				//r3-r2


				//算边(实际最后是三条边)

				xeg1 = sqrt(1*1+(r3x - x0)*(r3x - x0)*0.00467*0.00467 + (r3y - y0)*(r3y - y0)*0.00467*0.00467);//a1
				xeg2 = sqrt(1*1+(r2x - x0)*(r2x - x0)*0.00467*0.00467 + (r3y - y0)*(r3y - y0)*0.00467*0.00467);//c
				yeg1 = xeg2;
				yeg2 = sqrt(1*1+(r2x - x0)*(r2x - x0)*0.00467*0.00467 + (r2y - y0)*(r2y - y0)*0.00467*0.00467);//a2
				//算角
				deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (r2x - r3x)*(r2x - r3x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
				delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (r2y - r3y)*(r2y - r3y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
				deltx = (int)(abs(deltx));
				delty = (int)(abs(delty));
				if(deltx<400 && delty <400){
					tmx = deltx/5;
					tmy = delty/5;
					for(tmi = 0; tmi<5;tmi++){
						if(r2x<r3x){
							LoopCounter2+=tmx;
						}
						else{
							LoopCounter2-=tmx;
						}
						if(r2y>r3y){
							LoopCounter+=tmy;
							LoopCounter+=1;
						}
						else{
							LoopCounter-=tmy;
							LoopCounter+=1;
						}

						Update_ServoUS(kFTM_Chnl_0, LoopCounter);
						Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

						delay();
						delay();
						delay();
					}

				}
				delay();
				delay();
				delay();
				Round++;
				//r2-r1


				//算边(实际最后是三条边)

				xeg1 = sqrt(1*1+(r2x - x0)*(r2x - x0)*0.00467*0.00467 + (r2y - y0)*(r2y - y0)*0.00467*0.00467);//a1
				xeg2 = sqrt(1*1+(r1x - x0)*(r1x - x0)*0.00467*0.00467 + (r2y - y0)*(r2y - y0)*0.00467*0.00467);//c
				yeg1 = xeg2;
				yeg2 = sqrt(1*1+(r1x - x0)*(r1x - x0)*0.00467*0.00467 + (r1y - y0)*(r1y - y0)*0.00467*0.00467);//a2
				//算角
				deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (r1x - r2x)*(r1x - r2x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
				delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (r1y - r2y)*(r1y - r2y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
				deltx = (int)(abs(deltx));
				delty = (int)(abs(delty));
				if(deltx<400 && delty <400){
					tmx = deltx/5;
					tmy = delty/5;
					for(tmi = 0; tmi<5;tmi++){
						if(r1x<r2x){
							LoopCounter2+=tmx;
							LoopCounter2+=8;
						}
						else{
							LoopCounter2-=tmx;
							LoopCounter2+=8;
						}
						if(r1y>r2y){
							LoopCounter+=tmy;
						}
						else{
							LoopCounter-=tmy;
						}

						Update_ServoUS(kFTM_Chnl_0, LoopCounter);
						Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

						delay();
						delay();
						delay();
					}

				}
				delay();
				delay();
				delay();
				Round++;

				//r1-r0

				//算边(实际最后是三条边)

				xeg1 = sqrt(1*1+(r1x - x0)*(r1x - x0)*0.00467*0.00467 + (r1y - y0)*(r1y - y0)*0.00467*0.00467);//a1
				xeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r1y - y0)*(r1y - y0)*0.00467*0.00467);//c
				yeg1 = xeg2;
				yeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//a2
				//算角
				deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (r0x - r1x)*(r0x - r1x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
				delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (r0y - r1y)*(r0y - r1y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
				deltx = (int)(abs(deltx));
				delty = (int)(abs(delty));
				if(deltx<400 && delty <400){
					tmx = deltx/5;
					tmy = delty/5;
					for(tmi = 0; tmi<5;tmi++){
						if(r0x<r1x){
							LoopCounter2+=tmx;
						}
						else{
							LoopCounter2-=tmx;

						}
						if(r0y>r1y){
							LoopCounter+=tmy;
							LoopCounter+=1;
						}
						else{
							LoopCounter-=tmy;
							LoopCounter+=1;
						}

						Update_ServoUS(kFTM_Chnl_0, LoopCounter);
						Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

						delay();
						delay();
						delay();
					}

				}
				delay();
				delay();
				delay();
				Round++;


				delay();
		}
     			     		//算边(实际最后是三条边)










     		//法1
/*
     		switch(round){
     		case 0:

         		//red-r0
     			Dx = abs(b_rx - r0x);
     			Dy = abs(b_ry - r0y);
         		//算边(实际最后是三条边)

         		xeg1 = sqrt(1+(b_rx - x0)*(b_rx - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//a1
    			xeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//c
    			yeg1 = xeg2;
    			yeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//a2
         		//算角
         		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2 - (b_rx - r0x)*(b_rx - r0x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
    			delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2 - (b_ry - r0y)*(b_ry - r0y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
    			deltx = (int)(abs(deltx));
    			delty = (int)(abs(delty));
    			if((lastb_rx != b_rx || lastb_ry != b_ry) && deltx<400 && delty <400){
					if(r0x<b_rx){
	         			LoopCounter2+=deltx;
	         		}
	         		else{
	         			LoopCounter2-=deltx;
	         		}
	         		if(r0y>b_ry){
	         			LoopCounter+=delty;
	         		}
	         		else{
	         			LoopCounter-=delty;
	         		}
    			}
    			lastb_rx = b_rx;
    			lastb_ry = b_ry;
    			if(r0x<b_rx+3 && r0x>b_rx-3 && r0y>b_ry+3 && r0y>b_ry-3)round++;
     			break;
     		case 1:
         		//red-r1

     			Dx = abs(r0x - r1x);
     			Dy = abs(r0y - r1y);
         		//算边(实际最后是三条边)

         		xeg1 = sqrt(1*1+(b_rx - x0)*(b_rx - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//a1
    			xeg2 = sqrt(1*1+(r1x - x0)*(r1x - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//c
    			yeg1 = xeg2;
    			yeg2 = sqrt(1*1+(r1x - x0)*(r1x - x0)*0.00467*0.00467 + (r1y - y0)*(r1y - y0)*0.00467*0.00467);//a2
         		//算角
         		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (b_rx - r1x)*(b_rx - r1x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
    			delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (b_ry - r1y)*(b_ry - r1y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
    			deltx = (int)(abs(deltx));
    			delty = (int)(abs(delty));
    			if((lastb_rx != b_rx || lastb_ry != b_ry) && deltx<400 && delty <400){
					if(r1x<b_rx){
	         			LoopCounter2+=deltx;
	         		}
	         		else{
	         			LoopCounter2-=deltx;
	         		}
	         		if(r1y>b_ry){
	         			LoopCounter+=delty;
	         		}
	         		else{
	         			LoopCounter-=delty;
	         		}
	         		//round++;
    			}
    			lastb_rx = b_rx;
    			lastb_ry = b_ry;
    			if(r1x<b_rx+3 && r1x>b_rx-3 && r1y<b_ry+3 && r1y>b_ry-3)round++;
         		break;
     		case 2:
         		//red-r2

     			Dx = abs(r1x - r2x);
     			Dy = abs(r1y - r2y);
         		//算边(实际最后是三条边)

         		xeg1 = sqrt(1*1+(b_rx - x0)*(b_rx - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//a1
    			xeg2 =	sqrt(1*1+(r2x - x0)*(r2x - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//c
    			yeg1 = xeg2;
    			yeg2 = sqrt(1*1+(r2x - x0)*(r2x - x0)*0.00467*0.00467 + (r2y - y0)*(r2y - y0)*0.00467*0.00467);//a2
         		//算角
         		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (b_rx - r2x)*(b_rx - r2x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
    			delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (b_ry - r2y)*(b_ry - r2y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
    			deltx = (int)(abs(deltx));
    			delty = (int)(abs(delty));
    			if((lastb_rx != b_rx || lastb_ry != b_ry) && deltx<400 && delty <400){
					if(r2x<b_rx){
	         			LoopCounter2+=deltx;
	         		}
	         		else{
	         			LoopCounter2-=deltx;
	         		}
	         		if(r2y>b_ry){
	         			LoopCounter+=delty;
	         		}
	         		else{
	         			LoopCounter-=delty;
	         		}
	         		//round++;
    			}
    			lastb_rx = b_rx;
    			lastb_ry = b_ry;
    			if(r2x<b_rx+3 && r2x>b_rx-3 && r2y<b_ry+3 && r2y>b_ry-3)round++;
         		break;
     		case 3:
         		//red-r3

     			Dx = abs(r2x - r3x);
     			Dy = abs(r2y - r3y);
         		//算边(实际最后是三条边)

         		xeg1 = sqrt(1*1+(b_rx - x0)*(b_rx - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//a1
    			xeg2 = sqrt(1*1+(r3x - x0)*(r3x - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//c
    			yeg1 = xeg2;
    			yeg2 = sqrt(1*1+(r3x - x0)*(r3x - x0)*0.00467*0.00467 + (r3y - y0)*(r3y - y0)*0.00467*0.00467);//a2
         		//算角
         		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (b_rx - r3x)*(b_rx - r3x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
    			delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (b_ry - r3y)*(b_ry - r3y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
    			deltx = (int)(abs(deltx));
    			delty = (int)(abs(delty));
    			if((lastb_rx != b_rx || lastb_ry != b_ry) && deltx<400 && delty <400){
					if(r3x<b_rx){
	         			LoopCounter2+=deltx;
	         		}
	         		else{
	         			LoopCounter2-=deltx;
	         		}
	         		if(r3y>b_ry){
	         			LoopCounter+=delty;
	         		}
	         		else{
	         			LoopCounter-=delty;
	         		}
	         		//round++;
    			}
    			lastb_rx = b_rx;
    			lastb_ry = b_ry;
    			if(r3x<b_rx+3 && r3x>b_rx-3 && r3y<b_ry+3 && r3y>b_ry-3)round++;
     			break;
     		case 4:
         		//red-r0

     			Dx = abs(r3x - r0x);
     			Dy = abs(r3y - r0y);
         		//算边(实际最后是三条边)

         		xeg1 = sqrt(1*1+(b_rx - x0)*(b_rx - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//a1
    			xeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (b_ry - y0)*(b_ry - y0)*0.00467*0.00467);//c
    			yeg1 = xeg2;
    			yeg2 = sqrt(1*1+(r0x - x0)*(r0x - x0)*0.00467*0.00467 + (r0y - y0)*(r0y - y0)*0.00467*0.00467);//a2
         		//算角
         		deltx = 2000*(acos((xeg1*xeg1 + xeg2*xeg2- (b_rx - r0x)*(b_rx - r0x)*0.00467*0.00467)/(2*xeg1*xeg2)))/3.14;
    			delty = 2000*(acos((yeg1*yeg1 + yeg2*yeg2- (b_ry - r0y)*(b_ry - r0y)*0.00467*0.00467)/(2*yeg1*yeg2)))/3.14;
    			deltx = (int)(abs(deltx));
    			delty = (int)(abs(delty));
    			if((lastb_rx != b_rx || lastb_ry != b_ry) && deltx<400 && delty <400){
					if(r0x<b_rx){
	         			LoopCounter2+=deltx;
	         		}
	         		else{
	         			LoopCounter2-=deltx;
	         		}
	         		if(r0y>b_ry){
	         			LoopCounter+=delty;
	         		}
	         		else{
	         			LoopCounter-=delty;
	         		}
	         		//round=100;
    			}
    			lastb_rx = b_rx;
    			lastb_ry = b_ry;
    			if(r0x<b_rx+3 && r0x>b_rx-3 && r0y<b_ry+3 && r0y>b_ry-3)round = 100;
         		break;
     		}*/
     		break;



     	case 3:
     		switch(round){
     		case 0:
 			//if(Counter<5)Counter++;
 			//if(Counter>=5 )Counter = 0;
 			if(Counter == 0){
 				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter++;
 			}
 			if(LoopCounter>=1435){round++;delay_short();break;}
				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter++;
				if(LoopCounter>=1435){round++;delay_short();break;}
				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter++;
				if(LoopCounter>=1435){round++;delay_short();break;}
				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter++;
				if(LoopCounter>=1435){round++;delay_short();break;}
				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter++;
				if(LoopCounter>=1435){round++;delay_short();break;}
				break;
     		case 1:
 			//if(Counter2<5)Counter2++;
 			//if(Counter2>=5 )Counter2 = 0;
 			if(Counter2 == 0){
 				if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2++;
 			}
 			if(LoopCounter2>=1507){round++;delay_short();break;}
 			if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2++;
 			if(LoopCounter2>=1507){round++;delay_short();break;}
 			if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2++;
 			if(LoopCounter2>=1507){round++;delay_short();break;}
   			if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2++;
     		if(LoopCounter2>=1507){round++;delay_short();break;}
       		if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2++;
        	if(LoopCounter2>=1507){round++;delay_short();break;}
 			break;
     		case 2:
 			//if(Counter<5)Counter++;
 			//if(Counter>=5 )Counter = 0;
 			if(Counter == 0){
 				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter--;
 			}
 			if(LoopCounter<=1285){round++;delay_short();break;}
				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter--;
 			if(LoopCounter<=1285){round++;delay_short();break;}
				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter--;
 			if(LoopCounter<=1285){round++;delay_short();break;}
 			if(LoopCounter<=1285){round++;delay_short();break;}
				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter--;
 			if(LoopCounter<=1285){round++;delay_short();break;}
				if(LoopCounter>=1285 && LoopCounter<=1435)LoopCounter--;
 			break;
     		case 3:
 			//if(Counter2<5)Counter2++;
 			//if(Counter2>=5 )Counter2 = 0;
 			if(Counter2 == 0){
 				if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2--;
 			}
 			if(LoopCounter2<=1309){round = 0;delay_short();break;}
 			if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2--;
 			if(LoopCounter2<=1309){round = 0;delay_short();break;}
 			if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2--;
 			if(LoopCounter2<=1309){round = 0;delay_short();break;}
 			if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2--;
 			if(LoopCounter2<=1309){round = 0;delay_short();break;}
 			if(LoopCounter2>=1309 && LoopCounter2<=1507)LoopCounter2--;
 			if(LoopCounter2<=1309){round = 0;delay_short();break;}
 			break;
     		}
 		break;


