tongkong1/2023Ti/MK66F18_Ref9.c
     	}
     	Update_ServoUS(kFTM_Chnl_0, LoopCounter);
  	    Update_ServoUS(kFTM_Chnl_1, LoopCounter2);

     	delay_short();


 	   /*
 	    *     	int i = 0;
     	for(i = 0;i < 1000;i++) LoopCounter++;
     	delay_short();
     	for(i = 0;i < 1000;i++) LoopCounter2++;
     	delay_short();
     	for(i = 0;i < 1000;i++) LoopCounter--;
     	delay_short();
     	for(i = 0;i < 1000;i++) LoopCounter2--;
     	if(servo_update_flag)
 		{
  	       Update_ServoUS(kFTM_Chnl_0, LoopCounter);
  	       Update_ServoUS(kFTM_Chnl_1, LoopCounter);
  	       FTM_SetSoftwareTrigger(FTM3_PERIPHERAL, true);
  	       servo_update_flag = false;
 		}
     //	LoopCounter = (int)((angleXZ+1.57) / 3.14 * 2000);//转角换算为0-2000舵机随动计数
     	if (LoopCounter > 2500)
     		LoopCounter = 0;
     //	LoopCounter2 = (int)((angleYZ+1.57) / 3.14 * 2000);//转角换算为0-2000舵机随动计数
     	if (LoopCounter2 > 2500)
     		LoopCounter2 = 0;

 		*/

     	if (ElapsedSeconds != LastSecond)
     	{
     		LED1_TOGGLE();	LED2_TOGGLE();
     		LastSecond = ElapsedSeconds;

     		RTC_GetDatetime(RTC, &appDateTime);
     		sprintf(OLEDLine1, "Count: %d ", LoopCounter);
     		sprintf(OLEDLine2, "Count2: %d ", LoopCounter2);//OLED显示舵机转动计数
     		sprintf(OLEDLine3, "round: %d ", round);
     		sprintf(OLEDLine4, "xeg1: %2f ", xeg1);
     		OLED_P8x16Str(0, 0, (uint8_t *)OLEDLine1);
     		OLED_P8x16Str(0, 2, (uint8_t *)OLEDLine2);
     		OLED_P8x16Str(0, 4, (uint8_t *)OLEDLine3);
     		OLED_P8x16Str(0, 6, (uint8_t *)OLEDLine4);

     	}
         CDK66_Analog_Input(&AnalogIn);		// Update all analog inputs


         //MemsX1 = ((float)MemsX-2048.0)/101.3234;
         //MemsY1 = ((float)MemsY-2048.0)/101.3234;
         //MemsZ1 = ((float)MemsZ-2048.0)/101.3234;

     }
    return 0 ;
}
